Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/concurrent-mode-suspense_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: Because `<ProfileDetails>` suspended, React shows the closest `<Suspense>` fallback above it in the tree: `Loading profile...`.
ja: `<ProfileDetails>` がサスペンドしたので、React はツリーの直上にある `<Suspense>` フォールバックを表示します：`Loading profile...`。

source: We're done for now.
ja: ひとまずこれで終わりです。

source: This `resource` object represents the data that isn't there yet, but might eventually get loaded.
ja: この `resource` オブジェクトが、まだ存在していないがいずれロードされるであろうデータを表します。

source: When we call `read()`, we either get the data, or the component "suspends".
ja: `read()` を呼び出すと、データが手に入るか、あるいはコンポーネントが "サスペンド" します。

source: **As more data streams in, React will retry rendering, and each time it might be able to progress "deeper".** When `resource.user` is fetched, the `<ProfileDetails>` component will render successfully and we'll no longer need the `Loading profile...` fallback.
ja: **より多くのデータが到着するごとに React は再レンダーを試み、その度により「深い」ところまで進めるようになる可能性があります**。`resource.user` が取得できたら、`<ProfileDetails>` コンポーネントがレンダーされ、`Loading profile...` のフォールバックが不要になります。

source: Eventually, we'll get all the data, and there will be no fallbacks on the screen.
ja: 最終的に、すべてのデータが到着したら、画面上からフォールバックが消えます。

source: This has an interesting implication.
ja: これは興味深い事実を意味します。

source: Even if we use a GraphQL client that collects all data requirements in a single request, *streaming the response lets us show more content sooner*.
ja: 単一のリクエストで必要なすべてのデータを集めてくる GraphQL クライアントを使っていたとしても、*リソースのストリーミングのお陰で、より多くのコンテンツを早期から表示できるようになる*のです。

source: Because we render-*as-we-fetch* (as opposed to *after* fetching), if `user` appears in the response earlier than `posts`, we'll be able to "unlock" the outer `<Suspense>` boundary before the response even finishes.
ja: データ取得の*後*ではなくデータ取得を*行いながら*レンダーするので、レスポンス中で `user` が `posts` より先に現れたなら、レスポンスが終了する前に外側の `<Suspense>` バウンダリを "アンロック" 可能です。

source: We might have missed this earlier, but even the fetch-then-render solution contained a waterfall: between fetching and rendering.
ja: 見逃していたかもしれないので繰り返しますが、fetch-then-render のソリューションにも、データ取得とレンダーとの間でウォーターフォールが存在していました。

source: Suspense doesn't inherently suffer from this waterfall, and libraries like Relay take advantage of this.
ja: サスペンスにはこのウォーターフォールの問題がなく、Relay のようなライブラリはこのことをうまく利用します。

source: Note how we eliminated the `if (...)` "is loading" checks from our components.
ja: これにより `if (...)` による「ロード中か」のチェックが消えたことにも注意してください。

source: This doesn't only remove boilerplate code, but it also simplifies making quick design changes.
ja: これによりボイラープレートを減らせるだけでなく、素早い設計の変更が簡単になります。

source: For example, if we wanted profile details and posts to always "pop in" together, we could delete the `<Suspense>` boundary between them.
ja: 例えば、プロフィール詳細とタイムライン投稿が同時に「ぱっと」出現するようにしたくなったなら、その 2 つの間にある `<Suspense>` を取り除けばいいのです。

source: Or we could make them independent from each other by giving each *its own* `<Suspense>` boundary.
ja: あるいはそれぞれに*個別の* `<Suspense>` バウンダリを与えることでそれぞれを独立させることもできます。

source: Suspense lets us change the granularity of our loading states and orchestrate their sequencing without invasive changes to our code.
ja: サスペンスにより、コードに大きく手を加えることなしに、ロード中状態の粒度を変更し順番を制御できるようになります。

source: ## Start Fetching Early {#start-fetching-early}
ja: ## 早期から取得を開始する {#start-fetching-early}

source: If you're working on a data fetching library, there's a crucial aspect of Render-as-You-Fetch you don't want to miss.
ja: データ取得ライブラリを作成中なのであれば、Render-as-You-Fetch に関して忘れてはならない重要な特徴があります。

source: **We kick off fetching _before_ rendering.** Look at this code example closer:
ja: **レンダーより*前に*取得を開始する**ということです。コード例で詳しく見てみましょう：

source: Note that the `read()` call in this example doesn't *start* fetching.
ja: この例の `read()` 呼び出しが取得を*開始*しているのではありません。

source: It only tries to read the data that is **already being fetched**.
ja: **既に取得の最中である**データの読み出しを試みているだけです。

source: This difference is crucial to creating fast applications with Suspense.
ja: サスペンスを使って高速なアプリケーションを作成するにあたってこの違いは非常に重要です。

source: We don't want to delay loading data until a component starts rendering.
ja: コンポーネントのレンダーが始まるまでデータのロードを遅らせたくないのです。

source: As a data fetching library author, you can enforce this by making it impossible to get a `resource` object without also starting a fetch.
ja: データ取得ライブラリ作者は、実際のデータフェッチを始めないと `resource` オブジェクトが取得できないようにすることで、これを強制できます。

source: Every demo on this page using our "fake API" enforces this.
ja: このページの「フェイク API」を使ったすべてのデモは、これを強制しています。

source: You might object that fetching "at the top level" like in this example is impractical.
ja: この例のように「トップレベルで」データを取得するのは非現実的だと思われるかもしれません。

source: What are we going to do if we navigate to another profile's page?
ja: 別のプロフィールページに移動したくなったらどうするのでしょうか？

source: We might want to fetch based on props.
ja: props の値に応じてデータ取得をしたいのかもしれませんよね。

source: The answer to this is **we want to start fetching in the event handlers instead**.
ja: 答えは、**イベントハンドラでデータ取得を開始する**ことです。

source: Here is a simplified example of navigating between user's pages:
ja: ユーザページ間を移動するシンプルな例です：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/infallible-feather-xjtbu)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/infallible-feather-xjtbu)**

source: With this approach, we can **fetch code and data in parallel**.
ja: このアプローチにより、**コードとデータを並行して取得**できます。

source: When we navigate between pages, we don't need to wait for a page's code to load to start loading its data.
ja: ページ間でナビゲートする場合、ページのデータのロードを開始するためにそのページのコードがロードされるのを待つ必要はありません。

source: We can start fetching both code and data at the same time (during the link click), delivering a much better user experience.
ja: （リンクのクリック時に）コードとデータの両方の取得を開始すればよく、それでユーザ体験はずっと向上します。

source: This poses a question of how do we know *what* to fetch before rendering the next screen.
ja: 次に湧いてくる疑問は、次の画面をレンダーしていないのに**何を**取得するのかをどうやって知るのか、です。

source: There are several ways to solve this (for example, by integrating data fetching closer with your routing solution).
ja: これを解決するいくつかの方法があります（例えばデータ取得をルーティングソリューションの近くに統合する、など）。

source: If you work on a data fetching library, [Building Great User Experiences with Concurrent Mode and Suspense](/blog/2019/11/06/building-great-user-experiences-with-concurrent-mode-and-suspense.html) presents a deep dive on how to accomplish this and why it's important.
ja: あなたがデータ取得ライブラリの開発をしている場合は、[Building Great User Experiences with Concurrent Mode and Suspense](/blog/2019/11/06/building-great-user-experiences-with-concurrent-mode-and-suspense.html) で、どのようにこれを実現し、なぜこれが重要なのかについて説明されています。

source: ### We're Still Figuring This Out {#were-still-figuring-this-out}
ja: ### まだ仕様は検討中です {#were-still-figuring-this-out}

source: Suspense itself as a mechanism is flexible and doesn't have many constraints.
ja: 仕組みとしてのサスペンスは柔軟なものであり、制約は多くありません。

source: Product code needs to be more constrained to ensure no waterfalls, but there are different ways to provide these guarantees.
ja: 本番のコードではウォーターフォールがないことを保証するためにもっと制約が必要ですが、そのような保証を与えるための方法は様々です。

source: Some questions that we're currently exploring include:
ja: 我々が検討中の疑問は以下のようなものです：

source: * Fetching early can be cumbersome to express.
ja: * データ取得の早期開始を明示するのが難しいことがある。

source: How do we make it easier to avoid waterfalls?
ja: ウォーターフォールを避けるため、そこを簡単にできるか？

source: * When we fetch data for a page, can the API encourage including data for instant transitions *from* it?
ja: * あるページのデータを取得する時に、そのページ*から*即座に遷移できるためのデータを含めるよう API が仕向けるべきか？

source: * What is the lifetime of a response?
ja: * レスポンスのライフタイムは？

source: Should caching be global or local?
ja: キャッシュはグローバル、あるいはローカルであるべきか？

source: Who manages the cache?
ja: キャッシュをだれが管理するのか？

source: * Can Proxies help express lazy-loaded APIs without inserting `read()` calls everywhere?
ja: * Proxy を使うことで、あちこちに `read()` を挿入せずとも遅延ロード API を表現することが可能か？

source: * What would the equivalent of composing GraphQL queries look like for arbitrary Suspense data?
ja: * 任意のサスペンスデータに対して、GraphQL クエリの構築に相当するものはどのような見た目になるか？

source: Relay has its own answers to some of these questions.
ja: これらの疑問のいくつかについて Relay は独自の回答を有しています。

source: There is certainly more than a single way to do it, and we're excited to see what new ideas the React community comes up with.
ja: やり方は間違いなく複数あり、React コミュニティがどのようなものを新しく思いつくのか、楽しみにしています。

source: ## Suspense and Race Conditions {#suspense-and-race-conditions}
ja: ## サスペンスと競合状態 {#suspense-and-race-conditions}

source: Race conditions are bugs that happen due to incorrect assumptions about the order in which our code may run.
ja: 競合状態 (race condition) は、コードが実行される順番について誤った前提を置くために発生するバグです。

source: Fetching data in the `useEffect` Hook or in class lifecycle methods like `componentDidUpdate` often leads to them.
ja: `useEffect` フックやクラスの `componentDidUpdate` のようなライフサイクルメソッドを使ってデータ取得を行うと、しばしばこれが引き起こされます。

source: Suspense can help here, too — let's see how.
ja: サスペンスはここでも有用です。どのように有用なのか見てみましょう。

source: To demonstrate the issue, we will add a top-level `<App>` component that renders our `<ProfilePage>` with a button that lets us **switch between different profiles**:
ja: 問題の説明のために、トップレベルの `<App>` コンポーネントを追加して、`<ProfilePage>` をレンダーさせるとともに、**複数のプロフィールを切り替える**ことのできるボタンを配置しましょう：

source: Let's compare how different data fetching strategies deal with this requirement.
ja: この要求に対して複数のデータ取得法がどのようにするのかを比較してみましょう。

source: ### Race Conditions with `useEffect` {#race-conditions-with-useeffect}
ja: ### `useEffect` に伴う競合状態 {#race-conditions-with-useeffect}

source: First, we'll try a version of our original "fetch in effect" example.
ja: まずは元の「副作用内でデータ取得」の例を書き換えて試してみましょう。

source: We'll modify it to pass an `id` parameter from the `<ProfilePage>` props to `fetchUser(id)` and `fetchPosts(id)`:
ja: `<ProfilePage>` の props に渡された `id` を `fetchUser(id)` と `fetchPosts(id)` に渡すように書き換えます：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/nervous-glade-b5sel)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/nervous-glade-b5sel)**

source: Note how we also changed the effect dependencies from `[]` to `[id]` — because we want the effect to re-run when the `id` changes.
ja: `id` が変わるたびに副作用を再実行したいので、副作用の依存配列を `[]` から `[id]` に変えたことにも注意してください。

source: Otherwise, we wouldn't refetch new data.
ja: これをしなければ新しいデータの再取得ができません。

source: If we try this code, it might seem like it works at first.
ja: このコードを試すと、最初はうまく動いているように見えます。

source: However, if we randomize the delay time in our "fake API" implementation and press the "Next" button fast enough, we'll see from the console logs that something is going very wrong.
ja: しかし、我々の「フェイク API」実装の遅延時間をランダム化し、"Next" ボタンを素早く押下すると、コンソールログで非常におかしなことが起きていることに気づきます。

source: **Requests from the previous profiles may sometimes "come back" after we've already switched the profile to another ID -- and in that case they can overwrite the new state with a stale response for a different ID.**
ja: **時々、プロフィールを別の ID に切り替えた後になって、以前のプロフィールのリクエストが「返ってくる」のです。その場合、別の ID 用の古いレスポンスによって、新しい state が上書きされてしまいます。**

source: This problem is possible to fix (you could use the effect cleanup function to either ignore or cancel stale requests), but it's unintuitive and difficult to debug.
ja: この問題は修正可能です（副作用のクリーンアップ関数を使って古いリクエストを無視ないしキャンセルするようにできます）が、直観的でなく、デバッグも困難です。

source: ### Race Conditions with `componentDidUpdate` {#race-conditions-with-componentdidupdate}
ja: ### `componentDidUpdate` に伴う競合状態 {#race-conditions-with-componentdidupdate}

source: One might think that this is a problem specific to `useEffect` or Hooks.
ja: これが `useEffect` つまりフックに特有の問題だと思っている人がいるかもしれません。

source: Maybe if we port this code to classes or use convenient syntax like `async` / `await`, it will solve the problem?
ja: コードをクラスに移植するか `async` / `await` のような便利な記法を使えば、もしかして問題が解決するのでしょうか。

source: Let's try that:
ja: やってみましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/trusting-clarke-8twuq)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/trusting-clarke-8twuq)**

source: This code is deceptively easy to read.
ja: 見た目ほど難しいことをしている訳ではありません。

source: Unfortunately, neither using a class nor the `async` / `await` syntax helped us solve this problem.
ja: 残念ながら、クラスを使っても `async` / `await` 構文を使っても、この問題は解決しませんでした。

source: This version suffers from exactly the same race conditions, for the same reasons.
ja: このバージョンでも同じ理由により、全く同じような競合状態が発生しています。

source: ### The Problem {#the-problem}
ja: ### 問題の本質 {#the-problem}

source: React components have their own "lifecycle".
ja: React コンポーネントはそれぞれ「ライフサイクル」を持っています。

source: They may receive props or update state at any point in time.
ja: props の受け取りや state の更新は任意のタイミングで起こります。

source: However, each asynchronous request *also* has its own "lifecycle".
ja: しかし非同期なリクエスト*も*それぞれの「ライフサイクル」を持っているのです。

source: It starts when we kick it off, and finishes when we get a response.
ja: リクエストを発行したときに始まり、レスポンスを得た時に終わります。

source: The difficulty we're experiencing is "synchronizing" several processes in time that affect each other.
ja: 我々が直面している困難は互いに影響しあう複数のプロセスの「同期」です。

source: This is hard to think about.
ja: これは考えるのが難しい問題です。

source: ### Solving Race Conditions with Suspense {#solving-race-conditions-with-suspense}
ja: ### サスペンスで競合状態を解決する {#solving-race-conditions-with-suspense}

source: Let's rewrite this example again, but using Suspense only:
ja: この例を書き換えてサスペンスだけを使うようにしてみましょう：

source: In the previous Suspense example, we only had one `resource`, so we held it in a top-level variable.
ja: 以前の例では `resource` は 1 つだけだったのでトップレベルの変数として保持していました。

source: Now that we have multiple resources, we moved it to the `<App>`'s component state:
ja: 複数のリソースを使うようになったので、`<App>` のコンポーネント state に移動しました。

source: When we click "Next", the `<App>` component kicks off a request for the next profile, and passes *that* object down to the `<ProfilePage>` component:
ja: "Next" をクリックすると、`<App>` コンポーネントは次のプロフィールのためのリクエストを発行し、*その*オブジェクトを `<ProfilePage>` コンポーネントに渡します：

source: Again, notice that **we're not waiting for the response to set the state.
ja: 繰り返しになりますが、**レスポンスを待機して state を設定するのではありません。

source: It's the other way around: we set the state (and start rendering) immediately after kicking off a request**.
ja: その逆です。リクエスト開始の直後に state を設定して（そしてレンダーを開始して）います。

source: As soon as we have more data, React "fills in" the content inside `<Suspense>` components.
ja: **データが到着するにつれて、React が `<Suspense>` コンポーネント内を中身で「埋めて」くれます。

source: This code is very readable, but unlike the examples earlier, the Suspense version doesn't suffer from race conditions.
ja: このコードは非常に読みやすいですが、これまでの例とは違い、サスペンスを使ったバージョンは競合状態による問題の影響を受けません。

source: You might be wondering why.
ja: どうしてなのか気になるでしょうか。

source: The answer is that in the Suspense version, we don't have to think about *time* as much in our code.
ja: 答えは、サスペンスを使ったバージョンではコード内で*時間*のことをさほど気にする必要がないからです。

source: Our original code with race conditions needed to set the state *at the right moment later*, or otherwise it would be wrong.
ja: 競合状態があった元のコードでは、state を*未来における正しいタイミングで*設定する必要があり、さもなくば間違った動作になっていました。

source: But with Suspense, we set the state *immediately* -- so it's harder to mess it up.
ja: しかしサスペンスでは state を*すぐに*設定するので、間違いが起きづらくなるのです。

source: ## Handling Errors {#handling-errors}
ja: ## エラーの処理 {#handling-errors}

source: When we write code with Promises, we might use `catch()` to handle errors.
ja: Promise を使ってコードを書く際は、`catch()` を使ってエラーを処理していました。

source: How does this work with Suspense, given that we don't *wait* for Promises to start rendering?
ja: サスペンスでは Promise を使ってレンダー開始を*待つ*ことがないわけですが、エラー処理はどのようになるのでしょうか。

source: With Suspense, handling fetching errors works the same way as handling rendering errors -- you can render an [error boundary](/docs/error-boundaries.html) anywhere to "catch" errors in components below.
ja: サスペンスでは、データ取得のエラーの処理はレンダーのエラーと同様に動作します。配下のコンポーネントのエラーを "catch" するため、任意の場所で [error boundary](/docs/error-boundaries.html) をレンダーすることができます。

source: First, we'll define an error boundary component to use across our project:
ja: まず、我々のプロジェクト全体で使う error boundary コンポーネントを定義します：

source: And then we can put it anywhere in the tree to catch errors:
ja: その後に、エラーをキャッチするためにツリーの任意の場所に配置します：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/adoring-goodall-8wbn7)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/adoring-goodall-8wbn7)**

source: It would catch both rendering errors *and* errors from Suspense data fetching.
ja: これはレンダー中のエラーとサスペンスによるデータ取得時のエラーの*両方*をキャッチします。

source: We can have as many error boundaries as we like but it's best to [be intentional](https://aweary.dev/fault-tolerance-react/) about their placement.
ja: 好きなだけ error boundary を配置することができますが、配置は[計画的](https://aweary.dev/fault-tolerance-react/)に行いましょう。

source: ## Next Steps {#next-steps}
ja: ## 次のステップ {#next-steps}

source: We've now covered the basics of Suspense for Data Fetching!
ja: サスペンスによるデータ取得の基本について学びました！

source: Importantly, we now better understand *why* Suspense works this way, and how it fits into the data fetching space.
ja: 重要なことは、サスペンスが*なぜ*このように動作し、そしてデータ取得の領域でなぜうまく動くのかについてよりよく理解できた、ということです。

source: Suspense answers some questions, but it also poses new questions of its own:
ja: サスペンスによりいくつかの疑問が解決しましたが、新たな疑問も生じていることでしょう：

source: * If some component "suspends", does the app freeze?
ja: * コンポーネントが "サスペンド" するとアプリはフリーズするのか？

source: How to avoid this?
ja: 回避方法は？

source: * What if we want to show a spinner in a different place than "above" the component in a tree?
ja: * コンポーネントツリーの「上側」以外の場所でスピナーを表示したい場合は？

source: * If we intentionally *want* to show an inconsistent UI for a small period of time, can we do that?
ja: * 不整合な UI を意図的に短時間表示*したい*場合に、それは可能か？

source: * Instead of showing a spinner, can we add a visual effect like "greying out" the current screen?
ja: * スピナーを表示するのではなく「グレーアウト」のような視覚効果を加えることは可能か？

source: * Why does our [last Suspense example](https://codesandbox.io/s/infallible-feather-xjtbu) log a warning when clicking the "Next" button?
ja: * [最後のサスペンスの例](https://codesandbox.io/s/infallible-feather-xjtbu)で "Next" ボタンをクリックしたときにログに警告が記録されているのは何故か？

source: To answer these questions, we will refer to the next section on [Concurrent UI Patterns](/docs/concurrent-mode-patterns.html).
ja: これらの疑問に答えるために、次の記事、[並列的 UI パターン](/docs/concurrent-mode-patterns.html)に進みます。
